In [1]:
import pandas as pd
df=pd.read_csv('0000000000002370.csv')
df.head()

,SNo,Date,StartupName,IndustryVertical,SubVertical,CityLocation,InvestorsName,InvestmentType,AmountInUSD,Remarks
0,0,01/08/2017,TouchKin,Technology,Predictive Care Platform,Bangalore,Kae Capital,Private Equity,"1,300,000",NaN
1,1,02/08/2017,Ethinos,Technology,Digital Marketing Agency,Mumbai,Triton Investment Advisors,Private Equity,NaN,NaN
2,2,02/08/2017,Leverage Edu,Consumer Internet,Online platform for Higher Education Services,New Delhi,"Kashyap Deorah, Anand Sankeshwar, Deepak Jain,...",Seed Funding,NaN,NaN
3,3,02/08/2017,Zepo,Consumer Internet,DIY Ecommerce platform,Mumbai,"Kunal Shah, LetsVenture, Anupam Mittal, Hetal ...",Seed Funding,"500,000",NaN
4,4,02/08/2017,Click2Clinic,Consumer Internet,healthcare service aggregator,Hyderabad,"Narottam Thudi, Shireesh Palle",Seed Funding,"850,000",NaN

In [2]:
df['CityLocation']=df['CityLocation'].replace('bangalore','Bangalore')

In [5]:
df['CityLocation']=df['CityLocation'].replace('Delhi','New Delhi')

In [14]:
final_df=df[(df['CityLocation']=='Bangalore') | (df['CityLocation']=='New Delhi')]
final_df.head()

,SNo,Date,StartupName,IndustryVertical,SubVertical,CityLocation,InvestorsName,InvestmentType,AmountInUSD,Remarks
0,0,01/08/2017,TouchKin,Technology,Predictive Care Platform,Bangalore,Kae Capital,Private Equity,"1,300,000",NaN
2,2,02/08/2017,Leverage Edu,Consumer Internet,Online platform for Higher Education Services,New Delhi,"Kashyap Deorah, Anand Sankeshwar, Deepak Jain,...",Seed Funding,NaN,NaN
5,5,01/07/2017,Billion Loans,Consumer Internet,Peer to Peer Lending platform,Bangalore,Reliance Corporate Advisory Services Ltd,Seed Funding,"1,000,000",NaN
8,8,05/07/2017,Jumbotail,eCommerce,online marketplace for food and grocery,Bangalore,"Kalaari Capital, Nexus India Capital Advisors",Private Equity,"8,500,000",NaN
11,11,06/07/2017,Minjar,Technology,Cloud Solutions provider,Bangalore,"Blume Ventures, Contrarian Capital India Partn...",Seed Funding,NaN,NaN

In [16]:
final_df=final_df[['AmountInUSD']]
final_df

     AmountInUSD
0      1,300,000
2            NaN
5      1,000,000
8      8,500,000
11           NaN
...          ...
2190  10,000,000
2191         NaN
2196   3,500,000
2197         NaN
2198     400,000

[1013 rows x 1 columns]

In [17]:
final_df.dropna(inplace=True)
final_df

C:\Users\mohan\anaconda3\lib\site-packages\pandas\util\_decorators.py:311: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return func(*args, **kwargs)

     AmountInUSD
0      1,300,000
5      1,000,000
8      8,500,000
13     1,000,000
19    18,500,000
...          ...
2178  15,000,000
2181     500,000
2190  10,000,000
2196   3,500,000
2198     400,000

[618 rows x 1 columns]

In [20]:
amt=final_df['AmountInUSD']

0        1,300,000
5        1,000,000
8        8,500,000
13       1,000,000
19      18,500,000
           ...
2178    15,000,000
2181       500,000
2190    10,000,000
2196     3,500,000
2198       400,000
Name: AmountInUSD, Length: 618, dtype: object

In [24]:
final_amt=amt.str.replace(',','')
final_amt.head()

0      1300000
5      1000000
8      8500000
13     1000000
19    18500000
Name: AmountInUSD, dtype: object

In [26]:
final_amt=pd.to_numeric(final_amt)
final_amt

0        1300000
5        1000000
8        8500000
13       1000000
19      18500000
          ...
2178    15000000
2181      500000
2190    10000000
2196     3500000
2198      400000
Name: AmountInUSD, Length: 618, dtype: int64

In [34]:
Max=final_amt.max()
Min=final_amt.min()
Mean=final_amt.mean()
Mean

18017834.317152105

### Without Replacement

In [28]:
sample_size=50
sample=final_amt.sample(sample_size,random_state=1)
sample

1128      3000000
534       1000000
782        675000
1565     15000000
79       12300000
149        500000
823       3000000
494        500000
1520      1000000
1954      4850000
310        650000
43         200000
298        191000
227        600000
402        441000
313         50000
2129       200000
2024     16500000
1762     37500000
1134       550000
1046       500000
981        100000
131       5000000
492      15000000
1094      1000000
2120      3000000
932       6000000
1591      2000000
2149       200000
2115       470000
1278    200000000
1817     90000000
206       5500000
941      20000000
1697       200000
0         1300000
1273       125000
1716     45000000
578        150000
1021       900000
609       1050000
684      50000000
226       2000000
111       5000000
628      25000000
232       1000000
1101      1000000
1492      2000000
1295      5000000
542       4000000
Name: AmountInUSD, dtype: int64

In [40]:
type(sample)

pandas.core.series.Series

In [33]:
Max1=sample.max()
Min1=sample.min()
Avg1=sample.mean()
Avg1

11824040.0

In [32]:
sampling error=print(Mean-Avg1)

6193794.317152105

## With Replacement

In [35]:
sample_size=75
sample=final_amt.sample(sample_size,random_state=1,replace=True)
sample

119     104500000
822       2000000
249        750000
477       1000000
437         22500
          ...
863       5000000
1252      1000000
2114     16000000
655       1000000
1085        40000
Name: AmountInUSD, Length: 75, dtype: int64

In [38]:
Max2=sample.max()
Min2=sample.min()
Avg2=sample.mean()
Avg2

6917686.666666667

In [39]:
sampling_error1=print(Mean-Avg2)

11100147.650485437